; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v11 ?v7)
             (pred_8 ?v6 ?v5)
             (pred_3 ?v11 ?v5)
             (pred_4 ?v4 ?v11 )
	     (pred_7 ?v11)
             (pred_5 ?v9)
             (pred_10 ?v6)
             (pred_2 ?v5)
             (pred_11 ?v11)
             (pred_9 ?v6)
             (pred_12 ?v11)
             (pred_6 ))



(:action op_2
:parameters (?v13 ?v8 ?v12 ?v1)
:precondition (and (pred_5 ?v13) (pred_5 ?v8) (pred_10 ?v12) (pred_2 ?v1)
          (pred_1 ?v13 ?v8) (pred_8 ?v12 ?v1)
                   (pred_3 ?v8 ?v1) (pred_7 ?v13) 
                   (pred_11 ?v8) (pred_9 ?v12))
:effect (and  (pred_12 ?v8) (not (pred_11 ?v8))))


(:action op_4
:parameters (?v13 ?v3)
:precondition (and (pred_5 ?v13) (pred_5 ?v3)
               (pred_7 ?v13) (pred_1 ?v13 ?v3) (pred_12 ?v3))
:effect (and (pred_7 ?v3) (not (pred_7 ?v13))))

(:action op_1
:parameters (?v13 ?v12)
:precondition (and (pred_5 ?v13) (pred_10 ?v12) 
                  (pred_7 ?v13) (pred_4 ?v12 ?v13) (pred_6 ))
:effect (and (pred_9 ?v12)
   (not (pred_4 ?v12 ?v13)) (not (pred_6 ))))


(:action op_5
:parameters (?v13 ?v10 ?v2)
:precondition (and (pred_5 ?v13) (pred_10 ?v10) (pred_10 ?v2)
                  (pred_7 ?v13) (pred_9 ?v2) (pred_4 ?v10 ?v13))
:effect (and (pred_9 ?v10) (pred_4 ?v2 ?v13)
        (not (pred_9 ?v2)) (not (pred_4 ?v10 ?v13))))

(:action op_3
:parameters (?v13 ?v12)
:precondition (and (pred_5 ?v13) (pred_10 ?v12) 
                  (pred_7 ?v13) (pred_9 ?v12))
:effect (and (pred_6 ) (pred_4 ?v12 ?v13) (not (pred_9 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_17 obj_28 obj_11 obj_29 obj_26 obj_12 obj_05 obj_15 obj_27 obj_30 obj_23 obj_04 obj_06 obj_19 obj_01 obj_25 obj_22 obj_03 obj_24 obj_14 obj_02 obj_13 obj_20 obj_07
    obj_10 obj_18
    obj_16 obj_08 obj_09
    )

    (:init
       (pred_6)

       (pred_5 obj_21)
       (pred_5 obj_17)
       (pred_5 obj_28)
       (pred_5 obj_11)
       (pred_5 obj_29)
       (pred_5 obj_26)
       (pred_5 obj_12)
       (pred_5 obj_05)
       (pred_5 obj_15)
       (pred_5 obj_27)
       (pred_5 obj_30)
       (pred_5 obj_23)
       (pred_5 obj_04)
       (pred_5 obj_06)
       (pred_5 obj_19)
       (pred_5 obj_01)
       (pred_5 obj_25)
       (pred_5 obj_22)
       (pred_5 obj_03)
       (pred_5 obj_24)
       (pred_5 obj_14)
       (pred_5 obj_02)
       (pred_5 obj_13)
       (pred_5 obj_20)
       (pred_5 obj_07)
       (pred_2 obj_10)
       (pred_2 obj_18)
       (pred_10 obj_16)
       (pred_10 obj_08)
       (pred_10 obj_09)

       (pred_1 obj_21 obj_26)
       (pred_1 obj_21 obj_17)
       (pred_1 obj_17 obj_12)
       (pred_1 obj_17 obj_28)
       (pred_1 obj_17 obj_21)
       (pred_1 obj_28 obj_05)
       (pred_1 obj_28 obj_11)
       (pred_1 obj_28 obj_17)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_29)
       (pred_1 obj_11 obj_28)
       (pred_1 obj_29 obj_27)
       (pred_1 obj_29 obj_11)
       (pred_1 obj_26 obj_30)
       (pred_1 obj_26 obj_12)
       (pred_1 obj_26 obj_21)
       (pred_1 obj_12 obj_23)
       (pred_1 obj_12 obj_05)
       (pred_1 obj_12 obj_17)
       (pred_1 obj_12 obj_26)
       (pred_1 obj_05 obj_04)
       (pred_1 obj_05 obj_15)
       (pred_1 obj_05 obj_28)
       (pred_1 obj_05 obj_12)
       (pred_1 obj_15 obj_06)
       (pred_1 obj_15 obj_27)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_15 obj_05)
       (pred_1 obj_27 obj_19)
       (pred_1 obj_27 obj_29)
       (pred_1 obj_27 obj_15)
       (pred_1 obj_30 obj_01)
       (pred_1 obj_30 obj_23)
       (pred_1 obj_30 obj_26)
       (pred_1 obj_23 obj_25)
       (pred_1 obj_23 obj_04)
       (pred_1 obj_23 obj_12)
       (pred_1 obj_23 obj_30)
       (pred_1 obj_04 obj_22)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_05)
       (pred_1 obj_04 obj_23)
       (pred_1 obj_06 obj_03)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_15)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_19 obj_24)
       (pred_1 obj_19 obj_27)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_25)
       (pred_1 obj_01 obj_30)
       (pred_1 obj_25 obj_02)
       (pred_1 obj_25 obj_22)
       (pred_1 obj_25 obj_23)
       (pred_1 obj_25 obj_01)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_22 obj_03)
       (pred_1 obj_22 obj_04)
       (pred_1 obj_22 obj_25)
       (pred_1 obj_03 obj_20)
       (pred_1 obj_03 obj_24)
       (pred_1 obj_03 obj_06)
       (pred_1 obj_03 obj_22)
       (pred_1 obj_24 obj_07)
       (pred_1 obj_24 obj_19)
       (pred_1 obj_24 obj_03)
       (pred_1 obj_14 obj_02)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_02 obj_25)
       (pred_1 obj_02 obj_14)
       (pred_1 obj_13 obj_20)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_20 obj_07)
       (pred_1 obj_20 obj_03)
       (pred_1 obj_20 obj_13)
       (pred_1 obj_07 obj_24)
       (pred_1 obj_07 obj_20)
       (pred_11 obj_19)
       (pred_11 obj_28)
       (pred_11 obj_07)
       (pred_3  obj_19 obj_10)
       (pred_3  obj_28 obj_18)
       (pred_3  obj_07 obj_10)
       (pred_12 obj_21)
       (pred_12 obj_17)
       (pred_12 obj_11)
       (pred_12 obj_29)
       (pred_12 obj_26)
       (pred_12 obj_12)
       (pred_12 obj_05)
       (pred_12 obj_15)
       (pred_12 obj_27)
       (pred_12 obj_30)
       (pred_12 obj_23)
       (pred_12 obj_04)
       (pred_12 obj_06)
       (pred_12 obj_01)
       (pred_12 obj_25)
       (pred_12 obj_22)
       (pred_12 obj_03)
       (pred_12 obj_24)
       (pred_12 obj_14)
       (pred_12 obj_02)
       (pred_12 obj_13)
       (pred_12 obj_20)

       (pred_8  obj_16 obj_10)
       (pred_8  obj_08 obj_18)
       (pred_8  obj_09 obj_18)
       (pred_4 obj_16 obj_04)
       (pred_4 obj_08 obj_27)
       (pred_4 obj_09 obj_21)
       (pred_7 obj_23)
    )

    (:goal (and
       (pred_4 obj_16 obj_19)
       (pred_4 obj_09 obj_05)
    ))
(:constraints
  (always (not (pred_7 obj_12)))
)
)

; plan
1. (op_4 obj_23 obj_04)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_04)
   goals met: 0 of 2
2. (op_1 obj_04 obj_16)
   deleted: (pred_4 obj_16 obj_04) (pred_6)
   added: (pred_9 obj_16)
   goals met: 0 of 2
3. (op_4 obj_04 obj_06)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_06)
   goals met: 0 of 2
4. (op_2 obj_06 obj_19 obj_16 obj_10)
   deleted: (pred_11 obj_19)
   added: (pred_12 obj_19)
   goals met: 0 of 2
5. (op_4 obj_06 obj_19)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_19)
   goals met: 0 of 2
6. (op_3 obj_19 obj_16)
   deleted: (pred_9 obj_16)
   added: (pred_6) (pred_4 obj_16 obj_19)
   goals met: 1 of 2
7. (op_4 obj_19 obj_06)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_06)
   goals met: 1 of 2
8. (op_4 obj_06 obj_04)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_04)
   goals met: 1 of 2
9. (op_4 obj_04 obj_23)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_23)
   goals met: 1 of 2
10. (op_4 obj_23 obj_30)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_30)
   goals met: 1 of 2
11. (op_4 obj_30 obj_26)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_26)
   goals met: 1 of 2
12. (op_4 obj_26 obj_21)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_21)
   goals met: 1 of 2
13. (op_1 obj_21 obj_09)
   deleted: (pred_4 obj_09 obj_21) (pred_6)
   added: (pred_9 obj_09)
   goals met: 1 of 2
14. (op_4 obj_21 obj_17)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_17)
   goals met: 1 of 2
15. (op_2 obj_17 obj_28 obj_09 obj_18)
   deleted: (pred_11 obj_28)
   added: (pred_12 obj_28)
   goals met: 1 of 2
16. (op_4 obj_17 obj_28)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_28)
   goals met: 1 of 2
17. (op_4 obj_28 obj_05)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_05)
   goals met: 1 of 2
18. (op_3 obj_05 obj_09)
   deleted: (pred_9 obj_09)
   added: (pred_6) (pred_4 obj_09 obj_05)
   goals met: 2 of 2
